# ЗАДАЧА 8: Логические операторы and / or
#
# and — оба условия должны быть верны
# or — достаточно, чтобы хотя бы одно было верно
#
# 1. Спроси у пользователя число (n), не забудь про int()
# 2. Проверь с помощью if:
#    - если n больше 0 И (and) n меньше 100 , то 
#      выведи "Число в диапазоне от 0 до 100"
#    - иначе выведи "Число вне диапазона"
#
# 3. Дополнительно (если легко): спроси день недели (строка)
#    - если день равен "Суббота" ИЛИ (or) день равен "Воскресенье" 
#      , то выведи "Это выходной"
#    - иначе , тогда выведи "Это будний день"